#ifndef __GameLayer_H__
#define __GameLayer_H__

#include "cocos2d.h"
#include "SceneManager.h"
#include "vector"
#include "queue"
#include "time.h"

using namespace cocos2d;
using namespace std;

class GameLayer : public cocos2d::Layer
{
public:
	const int MaxSpritesCount=500;
	Sprite *backgroundSprite;//背景精灵
	Sprite *winSprite;//显示"你赢了"的精灵
	Sprite* heroSprite;//英雄精灵
	Animate* anmiAc[3];//英雄精灵的三个动画
	int anmiIndex=0;//当前动画索引
	int leftCoinMethodOnlyOne;//保证方法只执行一变的变量
	int rightCoinMethodOnlyOne;
	int foxMethodOnlyOne;
	int birdMethodOnlyOne;
	int manHeight=Director::getInstance()->getVisibleSize().height/2;//英雄的高度
	int L=128;//墙壁图片的高度
	int step=20;//每次update图片的步数
	int count=0;//左右蹦的标志位
	int iscore=0;//英雄的得分
	int tempCount;//降低分数的更新速度
	MenuItemImage *restart;//重新开始游戏
	Label *flushScore;//随时刷新的分数
	Label *finalScore;//本局最终得分
	Label *maxScore;//历史最高分
	Spawn *leftJumpAction;//英雄左跳的动作
	Spawn *rightJumpAction;//英雄右跳的动作
	Sprite* diedPopup;//死亡弹出框
	Sprite* down_pop;//暂停弹出框
	Sprite *decorate;//上方晒衣架装饰品
	Sprite *foxSprite;//狐狸精灵
	Sprite* leftWall[500];//左侧墙壁精灵集合
	Sprite* rightWall[500];//右侧墙壁精灵集合
	Sprite* leftEaveSprites[500];//左侧屋檐精灵集合
	Sprite *_scorebg;//得分背景框精灵
	Sprite *birdSprite;//鸟的精灵
	Sprite* rightEaveSprites[500];//右侧屋檐精灵集合
	Sprite3D* leftCoinSprites[500];//左侧金币精灵集合
	Sprite3D* rightCoinSprites[500];//右侧金币精灵集合
	Sprite3D* leftCoin;//左侧金币精灵
	Sprite3D* rightCoin;//右侧金币精灵
	bool moveFlag;//是否正在移动标志位
	bool birdIsLeft=true;//鸟是否在左边
	bool foxIsLeft=true;//标识狐狸是否在左边
	bool isDied;//标志是否死亡
    bool IsDownMenu=false;
	Animate *anmFox;//狐狸的动作
	Animate *anmBird;//鸟的动作
	clock_t foxStartTime;//狐狸开始时间
	clock_t startTime;//刚进入到此也页面的时间戳
	MenuItemImage* resume_game;//暂停弹出框的继续游戏
	MenuItemImage* caidan;//此菜单用于返回主界面
	MenuItemImage* _pause;//右下角暂停按钮
	SceneManager* sceneManager;//场景的管理者
	virtual bool init();//初始化的方法
	virtual void update(float dt);//update回调方法
	void showBirdAndFox();
    void rotateCoins();//旋转金币的方法
    void removeLabel(Label *label);//删除用于显示分数的label
    void destroyAllCoins();//销毁掉所有金币
	void initAnmiRF();//初始化换帧精灵
	bool onMyTouchBegin(Touch *touch,Event *event);//触控的四个方法
	void onMyTouchMoved(Touch *touch,Event *event);
	void onMyTouchEnded(Touch *touch,Event *event);
	void onMyTouchCalcelled(Touch *touch,Event *event);
	void downMenu();//死亡或者赢了了弹出菜单
	void setMoveFlag();//设置动作完成标志位的方法
	void leftJump();//向左跳的方法
	void rightJump();//向右跳的方法
	void menuResume_GameCallback(Ref* ref);//恢复暂停状态的游戏的回调方法
	void menuCaidanCallback(Ref* ref);//回到主界面的回调方法
	void menuPauseCallback(Ref* pSender);//暂停的回调方法
	void menuAgainCallback(Ref* ref);//重新开始的回调方法
	int leftEave[500]=
	{
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,
				0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	};

	int rightEave[500]=
	{
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,
				0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
	};

	int _jinbiLeft[500]={
				0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
				0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,
				0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,1,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,1,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,0,
				0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,
				0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,
	};

	int _jinbiRight[500]={
				0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,1,0,0,0,1,0,0,0,0,0,0,1,
				0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,1,
				0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,
				0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,
				0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,
				0,0,1,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,0,
				0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,
				0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,
				0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,
				0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,
				0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,
	};

    //Cocos2d-x中定义的一个宏，创建指定类型的对象
    //并做好相应的初始化与释放工作
    CREATE_FUNC(GameLayer);
};
#endif
